controllers/GoodsController.php

SELECT * FROM `tbl_goods_type_big` WHERE `status`=1
SELECT * FROM `tbl_goods_color` WHERE `status`=1
---
		//获取商品数据
		$list = Goods::getGoodsSelectZbt($start, $num, $order, $send_id, $goods_type_id);

		$goods_type = GoodsTypeBig::find()->where(['status'=>1])->all();
		$send_type = GoodsColor::find()->where(['status'=>1])->all();